Revit 2027 API
View.HasViewDiscipline Method
 Indicates if the view has a Discipline property
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasViewDiscipline()
Public Function HasViewDiscipline As Boolean
public:
bool HasViewDiscipline()
member HasViewDiscipline : unit -> bool
Return Value
Boolean
 True if the view has a Discipline property
See Also
Reference
View Class
Autodesk.Revit.DB Namespace